#+title: Neofetch configuration
#+setupfile: headers
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak's Neofetch config" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak's Neofetch config" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Description of the Neofetch config file of Phundrak" />
#+PROPERTY: header-args :noweb yes :exports code :tangle no :exports none
#+PROPERTY: header-args:sh :tangle ~/.config/neofetch/config.conf :exports code :noweb yes :padline no :mkdir yes :shebang "#!/usr/bin/env sh"

* The ~print_info~ functions
:PROPERTIES:
:CUSTOM_ID: The_print_info_functions-bb30763f
:END:
The ~print_info~ function is the function called by Neofetch in order to print the system information it could fetch. In this function, we’ll choose what to display, and how. This function looks like this:
#+BEGIN_SRC sh :tangle no
  print_info() {
      # Print information here…
  }
#+END_SRC

Generally, what we will display will be shown through the ~info~ function, redefined inside Neofetch (this is not ~info(1)~). This ~info~ function accepts one or two arguments. With one argument, such as with ~info memory~, we can get a result that looks like ~5136MiB / 15873MiB~, while calling it with two arguments will treat the first one as a prefix and the second one as the interesting information; ~info "Memory" memory~ will look like ~Memory: 5136MiB / 15873MiB~. Here is what we want to display:
#+NAME: info-elements-table
| Prefix   | Information | What it does                 |
|----------+-------------+------------------------------|
|          | title       | Username and hostname        |
|          | line_break  | Insert a blank line          |
|          | cols        | System theme                 |
|          | line_break  | Insert a blank line          |
| OS       | distro      | Distribution name            |
| Kernel   | kernel      | Kernel version               |
| Uptime   | uptime      | Machine uptime               |
| Packages | packages    | Number of installed packages |
| Shell    | shell       | User’s default shell         |
| WM       | wm          | User’s Window Manager        |
| Terminal | term        | Default terminal             |
| CPU      | cpu         | CPU information              |
| GPU      | gpu         | GPU information              |
| Memory   | memory      | RAM information              |

#+NAME: info-elements-gen
#+BEGIN_SRC emacs-lisp :var table=info-elements-table :cache yes
  (mapconcat (lambda (x)
               (format "info %s%s"
                       (if (not (string= (car x) ""))
                           (format "\"%s\" " (car x))
                         "")
                       (cadr x)))
             table
             "\n")
#+END_SRC

#+RESULTS[1e66bf48472ad24006f0cb9dc9c86078764ba84e]: info-elements-gen
#+begin_example
info line_break
info title
info line_break
info cols
info line_break
info "OS" distro
info "Kernel" kernel
info "Uptime" uptime
info "Packages" packages
info "Shell" shell
info "WM" wm
info "Terminal" term
info "CPU" cpu
info "GPU" gpu
info "Memory" memory
info "Disks" disks
#+end_example

Hence, the function looks like so:
#+BEGIN_SRC sh
  print_info() {
      <<info-elements-gen()>>
  }
#+END_SRC

Each of these modules can be tuned with the variables presented below.

